# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv('US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [11]:
baby_names.drop(columns=['Unnamed: 0', 'Id'], inplace=True)

In [12]:
baby_names.columns

Index(['Name', 'Year', 'Gender', 'State', 'Count'], dtype='object')

### Step 6. Is there more male or female names in the dataset?

In [17]:
m_f = baby_names.Gender.value_counts()
m_f

F    558846
M    457549
Name: Gender, dtype: int64

In [18]:
print('More males') if m_f.loc['M'] > m_f.loc['F'] else print('More females')

More females

### Step 7. Group the dataset by name and assign to names

In [71]:
#drop column year as not needed for sum
del baby_names['Year']

names = baby_names.groupby(baby_names.Name).sum()

In [72]:
names

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6
...        ...
Zyra        42
Zyrah       11
Zyren        6
Zyria       59
Zyriah      58

[17632 rows x 1 columns]

### Step 8. How many different names exist in the dataset?

In [77]:
names.sort_values(by='Count', ascending=False).head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

In [81]:
names.count()

Count    17632
dtype: int64

### Step 9. What is the name with most occurrences?

In [84]:
names.Count.idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [86]:
names[names.Count == names.Count.min()].count()

Count    2578
dtype: int64

### Step 11. What is the median name occurrence?

In [87]:
names[names.Count == names.Count.median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [88]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [89]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000